[
	{
		"title": "Simplest Barbecue Spice Rub",
		"description": "My go to barbecue rub for pulled pork and brisket.",
		"image": "spice-rub.webp",
		"imageAlt": "A jar of BBQ rub with different spices.",
		"imageTitle": "A jar of BBQ rub with different spices.",
		"tags": [
			"bbq",
			"spice-rubs",
			"easy"
		],
		"ingredients": [
			"1/2 cup of sea salt",
			"1/3 cup of coarse ground black pepper",
			"1/4 cup of garlic powder",
			"1/8 cup of smoked paprika"
		],
		"steps": [
			"Combine all ingredients together in your dish of choice. I like to use a mason jar.",
			"Stir until well combined. I'll typically shake the jar to mix it up.",
			"Apply liberally!"
		]
	},
	{
		"title": "Apple Blackberry Pie",
		"description": "This is my all-time favorite treat. A must-make every holiday season.",
		"image": "apple-blackberry-pie.webp",
		"imageAlt": "An apple blackberry pie with an oat topping",
		"tags": [
			"dessert",
			"holidays",
			"pie"
		]
	},
	{
		"title": "Instant Pot Pot Roast",
		"description": "Such a delicious and simple and fast way of making pot roast",
		"image": "pot-roast.webp",
		"imageAlt": "A delicious looking pot roast and vegetables",
		"tags": [
			"dinner",
			"beef",
			"instant-pot"
		],
		"ingredients": [
			{
				"sectionTitle": "Seasoning Mix",
				"sectionIngredients": [
					"1 tbsp Dark brown sugar",
					"1 tbsp Garlic Powder",
					"1/2 tbsp Onion Powder",
					"1/2 tbsp Sea Salt",
					"1 tsp Oregano",
					"1 tsp Thyme",
					"1 tsp Black Pepper",
					"1/2 tsp smoked paprika (regular paprika is fine too)"
				]
			},
			{
				"sectionTitle": "Pot Roast",
				"sectionIngredients": [
					"Salt and Pepper",
					"1 Chuck roast. Each pound feeds about 2 people. I usually get a 3 pound roast.",
					"4 cups of beef broth",
					"1 pound of full size carrots. Cut in about thirds",
					"2-3 pounds of mini potatoes. If you have larger potatoes, just cut them up",
					"1 large onion. Cut into fourths",
					"6 stalks of full-size celery, ends cut off, cut in half",
					"2 bay leaves"
				]
			}
		],
		"steps": [
			"Combine all of the seasoning mix ingredients together in a dish and set aside.",
			"Set your Instant Pot on Saute.",
			"Season the roast liberally on all sides with salt and pepper.",
			"Coat the bottom of the instant pot with a high smoke point oil (canola, vegetable, peanut, etc...) and sear the roast on all sides.",
			"Remove the roast and set it aside.",
			"Take a little bit of the beef broth and deglaze the bottom of the pot. Probably about a cup or half a cup.",
			"Add the roast back to the pot, along with your assortment of vegetables.",
			"Take a part of your seasoning mix and sprinkle it over the roast and vegetables.",
			"Add the rest of your beef broth into the pot along with two bay leaves.",
			"Add in the rest of your seasoning mix into the pot.",
			"Close and seal your Instant Pot and set it to manual for 95 minutes.",
			"If you have time, let it naturally release. It will probably take about 45 minutes. If not, you can force the release.",
			"Enjoy! It also makes great leftovers heated up in the microwave."
		]
	},
	{
		"title": "Popcorn Seasoning",
		"description": "A smoky, delicious seasoning for popcorn",
		"image": "popcorn-seasoning.webp",
		"imageAlt": "Some popcorn surrounded by salt, pepper, paprika, and chilis",
		"tags": [
			"popcorn",
			"spices",
			"spice-rubs"
		],
		"ingredients": [
			"1 tablespoon of sea salt",
			"1 tablespoon of coarse ground black pepper",
			"1 tablespoon of smoked paprika"
		],
		"steps": [
			"Combine all ingredients together in your dish of choice. I like to use a mason jar.",
			"Stir until well combined. I'll typically shake the jar to mix it up.",
			"Apply liberally!"
		]
	},
	{
		"title": "Chicken Florentine",
		"description": "A delicious creamy florentine sauce with crispy chicken.",
		"image": "chicken-florentine.webp",
		"imageAlt": "creamy sauce with chicken and noodles",
		"tags": [
			"dinner",
			"sauce",
			"pasta",
			"chicken",
			"italian"
		],
		"ingredients": [
			{
				"sectionTitle": "Chicken",
				"sectionIngredients": [
					"2-3 pounds chicken breast, sliced and pounded into cutlets",
					"1/2 cup of cornstarch",
					"1 tbsp of garlic powder",
					"1 tbsp of onion powder",
					"1 tbsp of smoked paprika",
					"1 tbsp of sea salt",
					"1 tbsp of black pepper",
					"1/2 tsp of cayenne pepper"
				]
			},
			{
				"sectionTitle": "Sauce",
				"sectionIngredients": [
					"1 lb of pasta of your choice (spaghetti doesn't work great for this, we typically use Gemelli)",
					"10 oz Cherry tomatoes (can use a little more or a little less, about the size of the medium container at the grocery store)",
					"1 large shallot or two medium sized shallots, chopped",
					"6-8 cloves of garlic, minced (or chopped is fine too)",
					"1/2 tsp of red pepper flakes",
					"1 cup of heavy cream",
					"About 14 oz of chicken broth",
					"1 tbsp of cornstarch",
					"1/4 cup fresh chopped basil (1 tbsp dry)",
					"1/4 cup fresh chopped parsley (1 tbsp dry)",
					"1 tsp dry oregano",
					"1 tsp dry thyme",
					"1/3 cup fresh grated Parmigano Reggiano (regular parm is fine too)",
					"1 1/2 cups of fresh spinach"
				]
			}
		],
		"steps": [
			"Combine your spices in the chicken section into a gallon ziploc bag (or paper bag or something else similar) and shake to combine",
			"Add your chicken to the bag and shake to coat"
		]
	},
	{
		"title": "One Pot Cajun Pasta",
		"description": "A delicious creamy and spicy cajun pasta",
		"image": "cajun-pasta.webp",
		"imageAlt": "penne noodles with parsley, sausage, and a creamy sauce",
		"tags": [
			"dinner",
			"sauce",
			"pasta",
			"sausage",
			"italian",
			"spicy",
			"cajun"
		],
		"ingredients": [
			"1 full sized andouille sausage",
			"5 cloves garlic",
			"4 cups chicken broth",
			"2 1/2 cups heavy cream",
			"1 pound penne pasta",
			"2 tblsp cajun seasoning",
			"4 oz (1/2 cup) fresh grated parmigano reggiano (regular parm is fine too)",
			"1/4 cup fresh chopped flat-leaf parsley"
		],
		"steps": [
			"Chop up your sausage and brown in your pan",
			"Chop up your garlic and add when your sausage is almost done. Cook for a few minutes until garlic is fragrant",
			"Add your chicken broth, cream, and pasta all to the pot. Stir to combine",
			"Add in half your cajun seasoning and allow to cook until pasta is al dente",
			"Turn off the heat and stir in the cheese until fully incorporated. Add in the rest of your cajun seasoning",
			"Sprinkle your chopped parsley on and serve hot!"
		]
	},
	{
		"title": "Birria Tacos",
		"description": "Slow cooked shredded beef, cooked in a birria consomme, with pepperjack cheese",
		"image": "birria-tacos.webp",
		"imageAlt": "Fully stuffed tacos with beef and cheese, next to a bowl of consomme",
		"tags": [
			"tacos",
			"beef",
			"mexican"
		],
		"ingredients": [],
		"steps": [
			"Take your chuck roast, trim the hard fat off, and cut into large chunks",
			"Season liberally with salt and pepper",
			"Brown the meat in a large pot (big enough to fit everything in)",
			"Turn the heat to low, and add in eight cups of water",
			"Add in your peeled garlic, roughly chopped onion, your dried chilis, your taco seasoning, beef bullion cubes, and your bay leaves",
			"Cover and let simmer for 2-3 hours",
			"Remove your peppers, garlic, and onion from the pot and blend them together with some of the broth from the pot. Return this blended mixture to the pot",
			"Cook for another hour or so until your meat is tender",
			"Remove the meat from the pot and shred it in a bowl with some of the consomme from the pot",
			"Dip your tortillas in the consomme and fry them in a pan",
			"Add your shredded beef and cheese to the tortillas, and fold them over, frying them on both sides"
		]
	},
	{
		"title": "Cast Iron Cornbread",
		"description": "A moist, sweet, delicious buttermilk cornbread",
		"image": "cornbread.webp",
		"imageAlt": "A cornbread with a slice from it in a cast iron pan with accouterments around it",
		"tags": [
			"sides",
			"butter",
			"bread",
			"southern"
		],
		"ingredients": [
			"1 1/2 cups buttermilk",
			"4 eggs",
			"4 tbs honey",
			"1 3/4 cups fine cornmeal (medium grind is acceptable, large won't work)",
			"1 tbs baking powder",
			"1 tsp salt",
			"3/4 tsp baking soda",
			"1/3 cups white sugar",
			"2 sticks melted butter",
			"3 cups all purpose flour"
		],
		"steps": [
			"Mix all ingredients in a large mixing bowl except butter and flour",
			"Pour the melted butter into the mixture and mix",
			"Pour the flour into the mixture and mix",
			"Butter down (you can also use cooking spray) a large cast iron skillet and pour the mixture in",
			"Bake at 375 for 30-35 minutes or until a toothpick comes out clean"
		]
	},
	{
		"title": "Taco Seasoning",
		"description": "A delicious, spicy, full bodied taco/mexican seasoning",
		"image": "taco-seasoning.webp",
		"imageAlt": "A bunch of spices, peppers, and chilis surrounding other spices",
		"tags": [
			"mexican",
			"spices",
			"spice-rubs",
			"spicy"
		],
		"ingredients": [
			"2 tsp cumin",
			"2 tsp dark chili powder (regular is fine)",
			"2 tsp sea salt (regular is fine)",
			"2 tsp garlic powder",
			"2 tsp Mexican oregano (other is fine)",
			"2 tsp smoked paprika (regular is fine)",
			"1 tsp black pepper",
			"1/4 tsp cayenne pepper"
		],
		"steps": [
			"Combine all ingredients together in your dish of choice. I like to use a mason jar.",
			"Stir until well combined. I'll typically shake the jar to mix it up.",
			"Apply liberally in taco soup, enchiladas, tacos, etc..."
		]
	},
	{
		"title": "Salmon with Avocado Salsa",
		"description": "A classic oven baked salmon with a lemon garlic glaze and an avocado salsa",
		"image": "salmon.webp",
		"imageAlt": "A salmon adorned with spices garlic and oil, with an avocado salsa",
		"tags": [
			"avocado",
			"salmon",
			"fish",
			"easy",
			"quick"
		],
		"ingredients": [
			{
				"sectionTitle": "Salmon",
				"sectionIngredients": [
					"3 Pounds of wild caught salmon (or your preference)",
					"Olive Oil",
					"Cracked Sea Salt",
					"Cracked Black Pepper"
				]
			},
			{
				"sectionTitle": "Salmon Glaze",
				"sectionIngredients": [
					"1/8 cup olive oil",
					"juice from 1 lemon",
					"1 tsp sea salt",
					"1 tsp black pepper",
					"1 tablespoon of fresh minced garlic (can also use garlic from a jar)"
				]
			},
			{
				"sectionTitle": "Avocado Salsa",
				"sectionIngredients": [
					"2 or 3 ripe avocados",
					"Juice of 1 lime (lemon would work too)",
					"1 tsp sea salt",
					"1 tsp coarse black pepper",
					"1 tablespoon of fresh minced garlic (can also use garlic from a jar",
					"2 tsp of hot sauce",
					"2 tablespoons of chopped cilantro"
				]
			}
		],
		"steps": [
			"Preheat oven to 375",
			"Take some foil and put it on a large enough oven safe pan for your salmon",
			"Rub the fish lightly with olive oil and crack on your salt and pepper until the salmon is well seasoned",
			"Mix all of your glaze ingredients together and pour your glaze on and over your salmon until it is fully covered and incorporated",
			"Put the salmon in the oven and let it cook for 20-25 minutes or until fully cooked with the sides slightly burning",
			"While the salmon cooks, mix your salsa together",
			"Roughly chop your avocados and put them in a small bowl",
			"Take the rest of your salsa ingredients and mix them into your avocados and mix it well, trying not to mash the avocados too much",
			"When the salmon is done, serve with the salsa on top"
		]
	},
	{
		"title": "Shrimp Tacos",
		"description": "Shrimp tacos with a spicy rub topped with a tangy salsa",
		"image": "shrimp-tacos.webp",
		"imageAlt": "Shrimp and mango salsa in a tortilla surrounded by spices, limes, garlic, and oil",
		"tags": [
			"tacos",
			"shrimp",
			"spicy",
			"mango",
			"mexican"
		],
		"steps": [
			"Start to prepare the mango salsa. Grab a dish, dice your mangoes and set in the dish",
			"Dice the red onion and add to the dish",
			"Chop the cilantro and add to the dish",
			"Slice the lime, squeeze in, and mix the salsa",
			"Crack in some sea salt and mix again",
			"Optionally chop your habenero and add to the salsa and mix",
			"Set your salsa to the side, and add some oil to a pan on medium heat",
			"Add your shrimp to the pan, and season with your favorite <a href='/recipes/taco-seasoning' title='Taco Seasoning'>taco seasoning</a>",
			"Sear off your shrimp and cook to done",
			"Remove your shrimp from the pan, set to the side, and add some more oil and some more taco seasoning to the pan",
			"Add your tortillas to the pan and toast them on both sides",
			"Remove your tortillas from the pan, and assemble your tacos",
			"Enjoy!"
		],
		"ingredients": [
			{
				"sectionTitle": "Mango Salsa",
				"sectionIngredients": [
					"3 ripe large mangoes",
					"1/2 red onion",
					"1/2 cup fresh cilantro",
					"1 juicy lime (or 2 if there's not very much juice",
					"Cracked sea salt",
					"OPTIONAL - 1 fresh habenero pepper for heat"
				]
			},
			{
				"sectionTitle": "Shrimp Tacos",
				"sectionIngredients": [
					"1 lb extra small peeled, deveined shrimp (or whatever size you want, if its large, chop them up a little bit)",
					"high smoke point oil",
					"Taco Seasoning",
					"Taco sized corn tortillas"
				]
			}
		]
	},
	{
		"title": "Buffalo Wings",
		"description": "Smoked, fried, or air fried chicken wings with a tangy, spicy buffalo sauce",
		"image": "buffalo-wings.webp",
		"imageAlt": "fried chicken covered in a red sauce with celery and dipping sauces",
		"tags": [
			"fried-chicken",
			"chicken-wings",
			"buffalo-sauce",
			"spicy"
		],
		"steps": [
			"Combine your buttermilk and pickle juice and drop your chicken wings in the mixture",
			"Let the wings sit in the mixture for at least 30 minutes, but up to 24 hours",
			"Combine the rest of the dry ingredients in a ziploc or paper bag and shake to mix",
			"Take your wings out of the buttermilk mixture and drop them in the bag with the dry ingredients, shake vigorously until the wings are well coated, and set to the side",
			"Set a small pot on your stove on low to medium heat and combine your hot sauce and butter",
			"Stir the sauce until the butter is melted and the sauce is well combined",
			"Add the rest of the buffalo sauce ingredients and stir until well combined",
			"Let it just barely bubble on low heat. If it separates, that's OK, just stir it back together",
			"Now, return to your chicken wings. There are a bunch of options, you can oil fry them, smoke them, or air fry them. If you're oil frying them, heat your oil to 375 and fry them for 10-12 minutes, continually flipping until they're done. If you're smoking them, smoke them at 250 for about 1 hour, continuously flipping every 20 minutes until done. If you're air frying them, air fry them at 375 for 25ish minutes, flipping until they're golden brown and crispy",
			"Once your wings are done, toss them in your buffalo sauce and serve with your favorite dipping sauces and veggies"
		],
		"ingredients": [
			{
				"sectionTitle": "Buffalo Sauce",
				"sectionIngredients": [
					"3/4 cup of Frank's Red Hot Sauce",
					"1 stick of cold butter",
					"1/4 tsp worcestershire sauce",
					"2 tbs white vinegar",
					"1/2 tsp garlic powder",
					"1/4 tsp cayenne pepper",
					"2 tsp cracked sea salt"
				]
			},
			{
				"sectionTitle": "Chicken Wings",
				"sectionIngredients": [
					"1 1/2 cups buttermilk (approx)",
					"1 cup pickle juice (approx)",
					"About 2 pounds of chicken wings",
					"About 2/3 cup cornstarch (not exact, just enough to coat the wings)",
					"2 tsp salt",
					"2 tsp pepper",
					"1 tsp garlic powder",
					"1 tsp onion powder",
					"2 tsp paprika",
					"1/2 tsp cayenne pepper"
				]
			}
		]
	},
	{
		"title": "Bacon Treats",
		"description": "A tater tot wrapped in bacon with jalapenos and cheese",
		"image": "bacon-treats.webp",
		"imageAlt": "A bunch of tater tots wrapped in bacon topped with jalapenos and cracked black pepper with cheese poking out",
		"tags": [
			"bacon",
			"snack",
			"spicy"
		],
		"ingredients": [
			"1 pound of thin sliced bacon",
			"A bunch of tater tots (probably about 32 if you're doing the full pound of bacon",
			"1 jalapeno",
			"1/4 - 1/2 cup of shredded cheddar cheese (depending on preference)"
		],
		"steps": [
			"Preheat your oven to 400",
			"Cut your bacon in half down the middle and seperate it into the individual strips",
			"Cut the ends off your jalapeno, slice it down the middle, and thinly slice each half, getting at least the same amount of pieces as slices of bacon you have (32 if you had 1 pound of bacon)",
			"Take a tater tot, put a slice of jalapeno on it, sprinkle some cheese on top, and wrap it in bacon",
			"Do this for all of your tater tots and bacon slices",
			"Put them on a baking sheet, crack some black pepper on all of them, and bake for 20-25 minutes or until the bacon is crispy",
			"Remove from the oven, and transfer to a paper towel to soak up some of the grease and immediately top with some cracked sea salt"
		]
	},
	{
		"title": "Fondant Potatoes",
		"description": "Seared potatoes cooked off with aromatics and chicken broth",
		"image": "fondant-potatoes.webp",
		"imageAlt": "A bunch of seared potatoes in broth surrounded by aromatics in a cast iron pan",
		"tags": [
			"sides",
			"potatoes",
			"vegan"
		],
		"ingredients": [
			"8 russet potatoes or larger yellow potatoes",
			"High smoke point oil (canola, vegetable, peanut)",
			"Sea Salt",
			"Black Pepper",
			"2 cups of chicken or vegetable broth",
			"1 head of garlic, top chopped off",
			"A few sprigs of fresh rosemary",
			"A few sprigs of Fresh thyme",
			"A few sprigs of Fresh Sage"
		],
		"steps": [
			"Start by peeling the potatoes. Then, trim both ends to create a stable, flat base, allowing the potato to stand upright. Finally, slice each potato in half crosswise.",
			"Coat in a high smoke point oil and copious amounts of sea salt and black pepper",
			"Put a little more oil on your cooking surface and sear both flat sides of the potato. Sometimes I'll sear the sides too.",
			"Add into your pan (use a pan that can withstand a high heat, like stainless steel or cast iron)",
			"Pour in your chicken broth, and add your aromatics around the pan",
			"Cook for about 45 minutes, or until your potatoes are fork tender",
			"Serve hot! Mash with a fork and pour some of the fond on top for a delicious bite!"
		]
	},
	{
		"title": "Chipotle Chicken",
		"description": "A smokey, spicy, marinated chicken thigh cooked in a variety of ways",
		"image": "chipotle-chicken.webp",
		"imageAlt": "A single piece of chicken with a chipotle marinade, topped with herbs and surrounded by spices and chilis",
		"tags": [
			"mexican",
			"chicken",
			"marinated",
			"spicy",
			"dinner"
		],
		"ingredients": [
			"",
			""
		],
		"steps": [
			"",
			""
		]
	},
	{
		"title": "Marinated Skirt Steak",
		"description": "A citrus-y, mexican, marinated skirt steak",
		"image": "skirt-steak.webp",
		"imageAlt": "A sliced, seared skirt steak on a plate surrounded by different citruses and spices",
		"tags": [
			"mexican",
			"steak",
			"marinated",
			"dinner"
		],
		"ingredients": [
			"",
			""
		],
		"steps": [
			"Combine all the ingredients besides the steak in a bowl or a gallon ziploc bag and mix well",
			"Add the steak to the marinade and let sit for at least 30 minutes (probably at least 2 hours)"
		]
	},
	{
		"title": "Award-Winning Chili",
		"description": "A deep, rich, spicy chili with a variety of meats, veggies, spices, and beans",
		"image": "chili.webp",
		"imageAlt": "A pot of deep red and dark chili with vegetables and beans and surrounded by spices",
		"tags": [
			"chili",
			"spicy",
			"dinner"
		],
		"ingredients": [
			{
				"sectionTitle": "Seasoning Mix",
				"sectionIngredients": [
					"1/4 cup chili powder",
					"4 tsp cumin",
					"2 tsp sea salt",
					"1 tsp smoked paprika",
					"1 tsp garlic powder",
					"1 tsp onion powder",
					"1 tsp black pepper",
					"1 tsp mexican oregano (can sub other oregano)",
					"1 tsp cocoa powder",
					"1/2 tsp cayenne pepper"
				]
			},
			{
				"sectionTitle": "Chili",
				"sectionIngredients": [
					"3 lbs good ground beef",
					"1 lb hot breakfast sausage",
					"3 fresh chopped jalapenos (sub one large green bell pepper for less spice)",
					"6 minced garlic cloves",
					"1 large yellow or white onion, diced",
					"44 oz of diced tomatoes",
					"4 oz hatch green chilis (heat is your preference)",
					"44 oz of tomato sauce",
					"6 oz of tomato paste (3/4 cup)",
					"3 cans of Medium Bush's Best Chili Magic Chili Starter, Campfire Style"
				]
			}
		],
		"steps": [
			"In a small dish, mix together all of the seasoning mix ingredients and set aside.",
			"In a large pot, brown the ground beef over medium heat. Drain the fat, but keep the meat in the pot.",
			"In the same pot, brown the sausage over medium heat. Don't drain the fat and keep the meat in the pot",
			"Chop up all the vegetables, and add them to the pot. Cook until veggies are a little softened. Maybe 5 minutes.",
			"Add the diced tomatoes and hatch green chilis to the pot. Stir to combine.",
			"Add the tomato sauce to the pot. Stir to combine.",
			"Add in the seasoning mix you prepared before. Stir to combine.",
			"Add in the tomato paste to the pot. Stir to combine.",
			"Let simmer on your stove for about an hour.",
			"Add in the three cans of beans and stir to combine.",
			"Let simmer another 45 minutes to an hour.",
			"Enjoy with your favorite toppings, such as cheddar cheese, sour cream, or maybe fritos corn chips!"
		]
	},
	{
		"title": "Jerk Marinade",
		"description": "A spicy Caribbean marinade for chicken, pork, or beef",
		"image": "jerk-marinade.webp",
		"imageAlt": "A table full of vegetables, spices, and liquids that all combine to make jerk marinade",
		"tags": [
			"caribbean",
			"spicy",
			"marinade"
		],
		"ingredients": [
			{
				"sectionTitle": "Marinade Base",
				"sectionIngredients": [
					"2 cups soy sauce",
					"1 tbsp worcestershire sauce",
					"1/2 cup apple cider vinegar",
					"1/3 cup molasses",
					"1/2 cup browning",
					"12-15 whole garlic cloves",
					"20-25 sprigs fresh thyme (about 1 whole small package from the grocery store) (cannot replace with dried thyme)",
					"1 large piece of whole ginger, chopped into about 4 or 5 pieces. Unpeeled.",
					"1/2 yellow onion, cut into 2 pieces",
					"5-6 whole scotch bonnets, stems removed. (can replace with Habeneros)",
					"1 whole bunch of green onions (8-10 stalks) (roots chopped off)"
				]
			},
			{
				"sectionTitle": "Spices",
				"sectionIngredients": [
					"1/4 cup whole pimento (all spice berries)",
					"2 tablespoons of whole peppercorn",
					"3-4 whole bay leaves",
					"2 whole cinnamon sticks",
					"1 whole nutmeg"
				]
			},
			{
				"sectionTitle": "Finishing Ingredients",
				"sectionIngredients": [
					"1/4 cup of sea salt",
					"1/8 cup brown sugar",
					"Juice of half a lemon"
				]
			}
		],
		"steps": [
			"Combine all of the marinade base ingredients in a strong blender, and blend until fairly smooth",
			"Put all the spices in a spice grinder (or coffee grinder) and grind down. Don't grind it too much to where its a powder though",
			"Add the spices to the marinade base and blend until incorporated",
			"After the spices are incorporated, add in the finishing ingredients and blend until incorporated",
			"Now you can use this marinade for chicken, pork, or beef. I like to marinate my meat for at least 24 hours, but you can do it for as little as 4 hours. The longer the better though! For jerk, poke holes in the meat before marinating."
		]
	},
	{
		"title": "Buttermilk Pancakes",
		"description": "The fluffiest, best pancake recipe you'll ever have",
		"image": "pancakes.webp",
		"imageAlt": "A table with a stack of pancakes with butter, syrup, blueberries, and chocolate chips",
		"tags": [
			"breakfast",
			"pancakes"
		],
		"ingredients": [
			"2 1/2 cups of all purpose flour",
			"3 tablespoons of sugar",
			"2 tsp of kosher salt",
			"1 tsp baking powder",
			"1 tsp baking soda",
			"2 1/2 cups of buttermilk",
			"1 stick of melted butter",
			"2 eggs, whites and yolks separated"
		],
		"steps": [
			"Combine the flour, sugar, salt, baking soda, baking powder, whisk together, and set to the side.",
			"Combine the buttermilk, butter, and the egg yolks and set to the side.",
			"Slowly add the wet ingredients to the dry ingredients and gently stir with a rubber spatula. Be sure to not overmix, this is IMPORTANT! It's okay if there are lumps.",
			"Pour the egg whites into the mixture and gently fold them in.",
			"Let the mixture sit for about 10 minutes. This is optional, but does help.",
			"Heat up your pan, and throw some butter on the pan. Drop about a 1/4 cup of batter onto the pan and cook until bubbles form on the top. If you want to add blueberries or chocolate chips, drop them onto your pancake before flipping while the batter is still pretty wet."
		]
	},
	{
		"title": "Instant Pot Mississippi Roast",
		"description": "A delicious, tangy, slow roasted beef",
		"image": "mississippi-roast.webp",
		"imageAlt": "A delicious looking roast with a tangy sauce and pepperocini peppers",
		"tags": [
			"dinner",
			"roast",
			"beef"
		],
		"ingredients": [
			"3 pound chuck roast (it can be larger or smaller - doesn't change much)",
			"1 cup of beef broth",
			"1 packet of ranch seasoning (maybe about 2 tablespoons if you don't have the packet)",
			"1 crushed beef bullion cube (or 2 or three if they're the small ones)",
			"1 stick of butter",
			"A few pepperocini peppers (optional) - however many is up to you and your spice preference!"
		],
		"steps": [
			"Season your liberally roast however you want (I prefer just salt and pepper).",
			"On the saute setting, sear your roast on all sides.",
			"Deglaze the bottom of the pot with your beef broth, scraping up all the bits.",
			"Add your roast back into the pot, put the stick of butter on top, and sprinkle on the crushed bullion cube and ranch seasoning.",
			"Add in however many pepperocini peppers (and the associated juice) you want.",
			"Set your Instant Pot to meat/stew (or manual) for 90 minutes.",
			"Let it naturally release, then shred up the beef."
		]
	},
	{
		"title": "Biscuits and Gravy",
		"description": "A delicious, southern breakfast classic",
		"image": "biscuits-and-gravy.webp",
		"imageAlt": "A cast iron pan of white sausage gravy, surrounded by biscuits",
		"tags": [
			"breakfast",
			"biscuits",
			"gravy"
		],
		"ingredients": [
			"1 roll of biscuits (or make your own)",
			"1 pound of ground breakfast sausage (I prefer maple, but go with your preference)",
			"1 stick of butter",
			"1/3 heaping cup of flour",
			"1 cup of heavy cream",
			"1 cup of milk (I prefer whole, but any of them work)"
		],
		"steps": [
			"Preheat oven to 350",
			"Heat up a cast iron pan and break up and cook your breakfast sausage until browned",
			"cube/break up your stick of butter and spread it throughout the pan",
			"Add in your flour and stir until the butter/flour mixture is well combined with the sausage",
			"Put your biscuits in the oven, and cook according to the pacakge",
			"Add in your heavy cream and milk and stir until well combined",
			"Crack in a ton of black pepper, and add some salt here too",
			"Let the gravy simmer until it thickens up",
			"Serve the gravy over the biscuits!"
		]
	}
]